## Plan for api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 4 to add, 2 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.assemblyline_rescan_every_24_hours will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "assemblyline_rescan_every_24_hours" {
        id                  = "retry-stale-scans-production"
        name                = "retry-stale-scans-production"
      ~ tags                = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      ~ tags_all            = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.clamav_update_avdefs will be created
  + resource "aws_cloudwatch_event_rule" "clamav_update_avdefs" {
      + arn                 = (known after apply)
      + description         = "Updates ClamAV virus database every 2 hours"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "clamav-update-avdefs-production"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(2 hour)"
      + tags                = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all            = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_event_target.trigger_api_lambda_to_download_clamav_defs will be created
  + resource "aws_cloudwatch_event_target" "trigger_api_lambda_to_download_clamav_defs" {
      + arn            = "arn:aws:lambda:ca-central-1:806545929748:function:api"
      + event_bus_name = "default"
      + id             = (known after apply)
      + input          = jsonencode(
            {
              + task = "clamav_update_virus_defs"
            }
        )
      + rule           = "clamav-update-avdefs-production"
      + target_id      = "scan-files-production-clamav-update-avdefs"
    }

  # module.api.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "api"
        tags                           = {
            "CostCentre" = "scan-files-production"
            "Terraform"  = "true"
        }
      ~ timeout                        = 120 -> 300
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.clamav-defs.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "scan-files-production-clamav-defs"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + logging {
          + target_bucket = "scan-files-production-logs"
          + target_prefix = "scan-files-production-clamav-defs"
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.clamav-defs.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 4 to add, 2 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.clamav-defs.aws_s3_bucket.this,
  on .terraform/modules/clamav-defs/S3/main.tf line 7, in resource "aws_s3_bucket" "this":
   7: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_versioning resource instead

(and 21 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
